spec/assets/cart_product.add.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="urn:Magento" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns2="http://xml.apache.org/xml-soap" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <SOAP-ENV:Body>
        <ns1:call>
            <sessionId xsi:type="xsd:string">token</sessionId>
            <resourcePath xsi:type="xsd:string">cart_product.add</resourcePath>
            <args SOAP-ENC:arrayType="xsd:ur-type[2]" xsi:type="SOAP-ENC:Array">
                <item xsi:type="xsd:int">1212</item>
                <item SOAP-ENC:arrayType="ns2:Map[2]" xsi:type="SOAP-ENC:Array">
                    <item xsi:type="ns2:Map">
                        <item>
                            <key xsi:type="xsd:string">product_id</key>
                            <value xsi:type="xsd:string">9987</value>
                        </item>
                        <item>
                            <key xsi:type="xsd:string">quantity</key>
                            <value xsi:type="xsd:int">1</value>
                        </item>
                    </item>
                    <item xsi:type="ns2:Map">
                        <item>
                            <key xsi:type="xsd:string">product_id</key>
                            <value xsi:type="xsd:int">9884</value>
                        </item>
                        <item>
                            <key xsi:type="xsd:string">quantity</key>
                            <value xsi:type="xsd:int">1</value>
                        </item>
                    </item>
                </item>
            </args>
        </ns1:call>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
